[
  {
    "blog_title": "How To Turn Your Thinking Around",
    "description": "Instead of getting entangled in worrying, see it as the perfect opportunity for you to observe your ego-mind. Either it’s wallowing in guilt or resentment about some past events or worrying about an imagined future which may or may not happen.The one who is worried is not ‘you’, it’s your ego.And if you become aware of ‘why’ there’s worry, you can probably detect that there’s some kind of proceeding change coming up in your life.It can be about thinking differently (transformation of consciousness); I suggest that if you feel worry right now, for anything at all; do your very best to become aware of how your mind always wanders from this present moment.Realize that whatever the mind comes up with you don’t have to believe.Thoughts and feelings are intertwined so whatever thoughts you have you also have an emotional response to them. Touch something and say to yourself “this is what is right now” and stay with it for a moment. Stay with it and look around you and say “this is what is. There’s nothing else going on but this, this moment right now”. Do this until you sense a detachment to your thinking mind. By doing this you will help your mind and body to relax into this present moment and thus drop the mind-made stories it’s making up. There really are better ways to use your imagination. The present moment is all we have, and when you get worried or fearful you’ve become lost. Fear and worry is just a thought and when you see this and bring your awareness to this very moment, there is peace."
  },
  {
    "blog_title": "Love, or Fear? You Choose.",
    "description": "If you want to live from Spirit or not is totally up to you and you can do that consciously by choosing Love no matter what, and you’re on the right path. There are other ways too in which you can invite the presence of Love in your experience right now, and that is to simply look at your life, and think of the opposite of something you are not totally pleased with. At any point in life when we feel fear welling up, or some of it’s cousins such as resentment, blame or self-pity, we can stop and remember what we are committed to; our vision. “I’m committed to the highest vision of myself and my life, and I will not let fear intrude that vision”. Love is easy and giving in its nature, while fear always has a story around it. A meaning we have given it by the thoughts and beliefs we have, but it’s not true, it’s just an interpretation through the eyes of the ego. When we are clear about where our commitment is (Love) then it’s easier to not get entangled in the fearful stories of the mind, and the quicker we can move away from the story and back to love again. It’s a shift that you can make at any time. We don’t have access to our greatness when we are stuck in a story and by asking “What do I really want here, what do I need?” we redirect the mind and awareness towards Truth. The ego has a lot of explanations but none of them are even the slightest believable when we examine them. When you have made a decision about what it is that you want, you stand by it, even when fear comes up at times – Remind yourself that you have chosen to operate from a place of Love and let fear go."
  },
  {
    "blog_title": "Honor Your Low Energy Days",
    "description": "It’s important to honor our low energy daysIf we don’t we just spiral further down into frustration.Most people are more or less programmed to always be on the go, to always do something, to always be active and so on but we all also have low energy days.Days when there’s no inspiration whatsoever to do anything, no motivation either, and things just simply feel flat and life-less.So what do most people do?They get frustrated about it, even depressed or angry.Some get into self-pity thinking they are doing something wrong or that they are being punished or hindered by some outside force.Depression, frustration, anger.. but not because of the low energy days themselves but because of the resistance to them.That’s where the suffering comes from.There is a solution to this though and here it is:Surrender to it. Try to enjoy this phase and do nothing.Do nothing about anything and enjoy it.Take a day off.Stop trying.Relax.Let it all go and accept that it’s part of the flow to go into these quiet phases where nothing seems to happen and there is no aliveness.Just experience everything without judgment, without resisting, without trying to change it.Stop struggling against the natural flow of your life.  It’s time to take it easy and this is how life lets you know. The suffering and frustration comes when we judge these phases as bad or wrong and even worse if we fall into the trap of believing that we’re being lazy and useless.What is needed is to surrender.Surrender to the experience of being uninspired, tired and lethargic.Allow yourself to let go of the need to change or “fix” anything.Just have the experience, allow it to be.You’d be amazed how quickly things change when resistance is let go of!The change we’re looking for comes from relaxing into doing nothing and instead let ourselves fall into the natural flow of things.This is when positive change can happen, and it happens naturally and all by itself as soon as we have let go of the tiller and stopped struggling against the tides of life."
  }
]
